#include <iostream>
#include <vector> // подключаем библиотеку, для создание вектора
// Вектор в C++ — это замена стандартному динамическому массиву, память для которого выделяется вручную, с помощью оператора new.
 
using namespace std;

double add_sub(); // функция отвечает за сложение, вычитание

double mult_div(); // функция отвечает за умножение, деление

double degree(); // функция отвечает за степень

double factor(); // функция отвечает за скобки  

double final_result(); // функция отвечает за результат
